allebedew/overcast-station-esp/sdkconfig.defaults
# Осознанные отклонения от дефолтов ESP-IDF.
# Полный sdkconfig генерируется из этого файла и не хранится в git.

CONFIG_IDF_TARGET="esp32c6"

# Кастомная таблица разделов: два OTA-раздела по 4 МБ (см. partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA: новая прошивка должна подтвердиться после загрузки
# (esp_ota_mark_app_valid_cancel_rollback), иначе бутлоадер откатится
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Статистика времени выполнения задач — для показа загрузки CPU
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Оптимизация по размеру
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
